# команда break в цикле while

В цикле while тожно можно использовать команду break. Иногда это бывает удобно. Вы просто добавляете еще одно условие для выхода из цикла.Давайте рассмотрим этот пример:

```
sum = 0

while True:
	user_info = int(input())
	if user_info == -1:
		print('Программа завершена')
		break
	else:
		sum += user_info

print(sum)		
```

Этот цикл будет работать бесконечно, но если вы введете -1, то цикл закончится. 

Задание:

С помощью циклов while очень удобно делать тестовые задания. Ваша задача написать программу для тестирования знаний математики. Программа должна вывести вопрос: "Сколько будет 8 * 5" (В будущем мы усложним тестирование). Пользователь должен ввести правильное число. Если он ввел ответ 40, то больше спрашиваь не надо. Если пользователь больше 3 раз ошибся, то тестирование тоже надо прекратить.  